source/.NET Standard/Unimake.Business.DFe/Servicos/Config/NFSe/BoaVistaRR.xml

<?xml version="1.0" encoding="utf-8"?>
<Configuracoes>
	<Servicos ID="NFSe">
		<CancelarNfse versao="2.03">
			<Descricao>Cancelar nota fiscal de serviço</Descricao>
			<WebEnderecoHomologacao>https://homologa-boavista.saatri.com.br/servicos/nfse.svc?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://boavista.saatri.com.br/servicos/nfse.svc?wsdl</WebEnderecoProducao>
			<TagAssinatura>InfPedidoCancelamento</TagAssinatura>
			<TagAtributoID>InfPedidoCancelamento</TagAtributoID>
			<WebContentType>text/xml</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soapenv:Header><wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:UsernameToken wsu:Id="UsernameToken-18"><wsse:Username>{MunicipioUsuario}</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{MunicipioSenha}</wsse:Password></wsse:UsernameToken></wsse:Security></soapenv:Header><soapenv:Body><nfse:CancelarNfseRequest><nfseCabecMsg><![CDATA[<cabecalho xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.abrasf.org.br/nfse.xsd" versao="2.01"><versaoDados>2.01</versaoDados></cabecalho>]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]><![CDATA[></nfseDadosMsg></nfse:CancelarNfseRequest></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>s:Body</WebTagRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.03</SchemaVersao>
		</CancelarNfse>
		<ConsultarLoteRps versao="2.03">
			<Descricao>Consulta lote RPS</Descricao>
			<WebEnderecoHomologacao>https://homologa-boavista.saatri.com.br/servicos/nfse.svc?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://boavista.saatri.com.br/servicos/nfse.svc?wsdl</WebEnderecoProducao>
			<WebContentType>text/xml</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soapenv:Header/><soapenv:Body><nfse:ConsultarLoteRpsRequest><nfseCabecMsg><cabecalho xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.abrasf.org.br/nfse.xsd" versao="2.01"><versaoDados>2.01</versaoDados></cabecalho></nfseCabecMsg><nfseDadosMsg>{xmlBody}</nfseDadosMsg></nfse:ConsultarLoteRpsRequest></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>s:Body</WebTagRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.03</SchemaVersao>
		</ConsultarLoteRps>
		<ConsultarNfseFaixa versao="2.03">
			<Descricao>Consulta NFSe por Faixa</Descricao>
			<WebEnderecoHomologacao>https://homologa-boavista.saatri.com.br/servicos/nfse.svc?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://boavista.saatri.com.br/servicos/nfse.svc?wsdl</WebEnderecoProducao>
			<WebContentType>text/xml</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soapenv:Header/><soapenv:Body><nfse:ConsultarNfsePorFaixaRequest><nfseCabecMsg><![CDATA[<cabecalho xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.abrasf.org.br/nfse.xsd" versao="2.01"><versaoDados>2.01</versaoDados></cabecalho>]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]><![CDATA[></nfseDadosMsg></nfse:ConsultarNfsePorFaixaRequest></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>s:Body</WebTagRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.03</SchemaVersao>
		</ConsultarNfseFaixa>
		<ConsultarNfsePorRps versao="2.03">
			<Descricao>Consulta NFSe por RPS</Descricao>
			<WebEnderecoHomologacao>https://homologa-boavista.saatri.com.br/servicos/nfse.svc?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://boavista.saatri.com.br/servicos/nfse.svc?wsdl</WebEnderecoProducao>
			<WebContentType>text/xml</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:nfse="http://nfse.abrasf.org.br" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:UsernameToken wsu:Id="UsernameToken-13"><wsse:Username>{MunicipioUsuario}</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{MunicipioSenha}</wsse:Password></wsse:UsernameToken></wsse:Security></soapenv:Header><soapenv:Body><nfse:ConsultarNfsePorRpsRequest><nfseCabecMsg><![CDATA[<cabecalho xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.abrasf.org.br/nfse.xsd" versao="2.01"><versaoDados>2.01</versaoDados></cabecalho>]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]><![CDATA[></nfseDadosMsg></nfse:ConsultarNfsePorRpsRequest></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>s:Body</WebTagRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.03</SchemaVersao>
		</ConsultarNfsePorRps>
		<ConsultarNfseServicoPrestado versao="2.03">
			<Descricao>Consulta NFSe de serviços prestados</Descricao>
			<WebEnderecoHomologacao>https://homologa-boavista.saatri.com.br/servicos/nfse.svc?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://boavista.saatri.com.br/servicos/nfse.svc?wsdl</WebEnderecoProducao>
			<WebContentType>text/xml</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:nfse="http://nfse.abrasf.org.br" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:UsernameToken wsu:Id="UsernameToken-20"><wsse:Username>{MunicipioUsuario}</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{MunicipioSenha}</wsse:Password></wsse:UsernameToken></wsse:Security></soapenv:Header><soapenv:Body><nfse:ConsultarNfseServicoPrestadoRequest><nfseCabecMsg><![CDATA[<cabecalho xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.abrasf.org.br/nfse.xsd" versao="2.01"><versaoDados>2.01</versaoDados></cabecalho>]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]><![CDATA[></nfseDadosMsg></nfse:ConsultarNfseServicoPrestadoRequest></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>s:Body</WebTagRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.03</SchemaVersao>
		</ConsultarNfseServicoPrestado>
		<ConsultarNfseServicoTomado versao="2.03">
			<Descricao>Consulta NFSe de serviços tomados</Descricao>
			<WebEnderecoHomologacao>https://homologa-boavista.saatri.com.br/servicos/nfse.svc?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://boavista.saatri.com.br/servicos/nfse.svc?wsdl</WebEnderecoProducao>
			<WebContentType>text/xml</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:nfse="http://nfse.abrasf.org.br" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:UsernameToken wsu:Id="UsernameToken-23"><wsse:Username>{MunicipioUsuario}</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{MunicipioSenha}</wsse:Password></wsse:UsernameToken></wsse:Security></soapenv:Header><soapenv:Body><nfse:ConsultarNfseServicoTomadoRequest><nfseCabecMsg><![CDATA[<cabecalho xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.abrasf.org.br/nfse.xsd" versao="2.01"><versaoDados>2.01</versaoDados></cabecalho>]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]><![CDATA[></nfseDadosMsg></nfse:ConsultarNfseServicoTomadoRequest>/soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>s:Body</WebTagRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.03</SchemaVersao>
		</ConsultarNfseServicoTomado>
		<GerarNfse versao="2.03">
			<Descricao>Gerar Nota Fiscal de Serviço</Descricao>
			<WebEnderecoHomologacao>https://homologa-boavista.saatri.com.br/servicos/nfse.svc?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://boavista.saatri.com.br/servicos/nfse.svc?wsdl</WebEnderecoProducao>
			<TagAssinatura>InfDeclaracaoPrestacaoServico</TagAssinatura>
			<TagAtributoID>InfDeclaracaoPrestacaoServico</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID>Rps</TagLoteAtributoID>
			<WebContentType>text/xml</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soapenv:Header><wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:UsernameToken wsu:Id="UsernameToken-18"><wsse:Username>{MunicipioUsuario}</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{MunicipioSenha}</wsse:Password></wsse:UsernameToken></wsse:Security></soapenv:Header><soapenv:Body><nfse:GerarNfseRequest><nfseCabecMsg><![CDATA[<cabecalho xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.abrasf.org.br/nfse.xsd" versao="2.01"><versaoDados>2.01</versaoDados></cabecalho>]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]><![CDATA[></nfseDadosMsg></nfse:GerarNfseRequest></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>s:Body</WebTagRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.03</SchemaVersao>
		</GerarNfse>
		<RecepcionarLoteRps versao="2.03">
			<Descricao>Recepcionar Lote RPS</Descricao>
			<WebEnderecoHomologacao>https://homologa-boavista.saatri.com.br/servicos/nfse.svc?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://boavista.saatri.com.br/servicos/nfse.svc?wsdl</WebEnderecoProducao>
			<TagAssinatura>InfDeclaracaoPrestacaoServico</TagAssinatura>
			<TagAtributoID>LoteRps</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID>InfDeclaracaoPrestacaoServico</TagLoteAtributoID>
			<WebContentType>text/xml</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soapenv:Header/><soapenv:Body><nfse:RecepcionarLoteRpsRequest><nfseCabecMsg><![CDATA[<cabecalho xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.abrasf.org.br/nfse.xsd" versao="2.01"><versaoDados>2.01</versaoDados></cabecalho>]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]><![CDATA[></nfseDadosMsg></nfse:RecepcionarLoteRpsRequest></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>s:Body</WebTagRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.03</SchemaVersao>
		</RecepcionarLoteRps>
		<RecepcionarLoteRpsSincrono versao="2.03">
			<Descricao>Recepcionar Lote RPS Sincrono</Descricao>
			<WebEnderecoHomologacao>https://homologa-boavista.saatri.com.br/servicos/nfse.svc?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://boavista.saatri.com.br/servicos/nfse.svc?wsdl</WebEnderecoProducao>
			<TagAssinatura>InfDeclaracaoPrestacaoServico</TagAssinatura>
			<TagAtributoID>LoteRps</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID>InfDeclaracaoPrestacaoServico</TagLoteAtributoID>
			<WebContentType>text/xml</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soapenv:Header/><soapenv:Body><nfse:RecepcionarLoteRpsSincronoRequest><nfseCabecMsg><![CDATA[<cabecalho xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.abrasf.org.br/nfse.xsd" versao="2.01"><versaoDados>2.01</versaoDados></cabecalho>]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]><![CDATA[></nfseDadosMsg></nfse:RecepcionarLoteRpsSincronoRequest></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>s:Body</WebTagRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.03</SchemaVersao>
		</RecepcionarLoteRpsSincrono>
		<SubstituirNfse versao="2.03">
			<Descricao>Substituir nota fiscal de Serviço</Descricao>
			<WebEnderecoHomologacao>https://homologa-boavista.saatri.com.br/servicos/nfse.svc?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://boavista.saatri.com.br/servicos/nfse.svc?wsdl</WebEnderecoProducao>
			<TagAssinatura>InfDeclaracaoPrestacaoServico</TagAssinatura>
			<TagAtributoID>SubstituicaoNfse</TagAtributoID>
			<TagLoteAtributoID></TagLoteAtributoID>
			<TagExtraAtributoID></TagExtraAtributoID>
			<WebContentType>text/xml</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soapenv:Header><wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:UsernameToken wsu:Id="UsernameToken-18"><wsse:Username>{MunicipioUsuario}</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{MunicipioSenha}</wsse:Password></wsse:UsernameToken></wsse:Security></soapenv:Header><soapenv:Body><nfse:SubstituirNfseRequest><nfseCabecMsg><![CDATA[<cabecalho xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.abrasf.org.br/nfse.xsd" versao="2.01"><versaoDados>2.01</versaoDados></cabecalho>]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]><![CDATA[</nfseDadosMsg></nfse:SubstituirNfseRequest></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>s:Body</WebTagRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.03</SchemaVersao>
		</SubstituirNfse>
	</Servicos>
</Configuracoes>